Статистика работы механизмов/Конфигурация/DataProcessors/_УведомленияПоКвалифицированнымИнвесторам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_УведомленияПоКвалифицированнымИнвесторам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиКвалифицированности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_УведомленияПоКвалифицированнымИнвесторам/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Уведомления по квалифицированным инвесторам", "0.2", , Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомленияПоКвалифицированнымИнвесторамРЭМ", 	"Уведомления по квалифицированным инвесторам (РЭМ)",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомленияПоКвалифицированнымИнвесторамТраст", 	"Уведомления по квалифицированным инвесторам (Траст)",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомленияПоКвалифицированнымИнвесторамРПИ", 	"Уведомления по квалифицированным инвесторам (РПИ)",,	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

#Область Формирование_уведомлений

Процедура ОтправитьУведомления(Отказ = Ложь) Экспорт
	
	ОтправитьУведомленияПослеВыводаВсехАктивов(Отказ);
	ОтправитьУведомленияОНеобходимостиПродлитьКвалифицированность(Отказ);	
	
КонецПроцедуры

Процедура ОтправитьУведомленияПослеВыводаВсехАктивов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоДня", 		НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("КонецДня", 		КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);  		
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУСВыводами
		|ИЗ
		|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|ГДЕ
		|	ВыводДенежныхСредств.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И ВыводДенежныхСредств.Проведен
		|	И ВыводДенежныхСредств.Организация = &Организация
		|	И ВыводДенежныхСредств.Основание.ВыводВсехАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|ГДЕ
		|	ВыводЦенныхБумаг.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И ВыводЦенныхБумаг.Проведен
		|	И ВыводЦенныхБумаг.Организация = &Организация
		|	И ВыводЦенныхБумаг.Поручение.ВыводВсехАктивов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.СубъектАналитики КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУБезАктивов
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики В
		|			(ВЫБРАТЬ
		|				_СчетаДУСВыводами.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДУСВыводами)
		|	И ФинансовыеПоказатели.Период = &НачалоДня
		|	И ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Значение = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ЮрФизЛица
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&КонецДня,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУБезактивов.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУБезактивов)) КАК КлиентыДоверительногоУправленияСрезПоследних";
			
	Запрос.Выполнить();
	
	РаботаСОтчетами.ПоместитьКвалифицированныхИнвесторовВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект.Организация, ЭтотОбъект.Дата, "_ЮрФизЛица",, Истина);
	
	// Убираем квалов в силу закона
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КвалифицированныеИнвесторы.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	_КвалифицированныеИнвесторы КАК _КвалифицированныеИнвесторы
		|ГДЕ
		|	НЕ _КвалифицированныеИнвесторы.ВСилуЗакона";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда		
		Возврат;
	КонецЕсли;
	
	МассивЮрЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЮрФизЛицо");
	
	Если МассивЮрЛиц.Количество() > 0 Тогда                     		
		
		ТекстСообщения = "Выведены все активы у квалифицированных инвесторов:" + Символы.ПС + СтрСоединить(МассивЮрЛиц, Символы.ПС) + Символы.ПС + "Необходимо исключить их из реестра квалифицированных лиц";
		
		СформироватьОповещение("Вывод всех активов квалифицированного инвестора", ТекстСообщения);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьУведомленияОНеобходимостиПродлитьКвалифицированность(Отказ)
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Оповестить нужно за 30 дней до окончания года от предыдущей даты
	ДеньДляПроверкиСрока = ЭтотОбъект.ДатаПроверкиКвалифицированности - 335 * 24 * 60 * 60;
	
	Запрос.УстановитьПараметр("Период", 				КонецДня(ЭтотОбъект.ДатаПроверкиКвалифицированности));
	Запрос.УстановитьПараметр("ДеньДляПроверкиСрока", 	ДеньДляПроверкиСрока);
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);  		
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеПеречниСрезПоследних.Период КАК Период,
		|	ВнутренниеПеречниСрезПоследних.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы)
		|				И Объект.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)) КАК ВнутренниеПеречниСрезПоследних
		|ГДЕ
		|	ВнутренниеПеречниСрезПоследних.Действует
		|	И НАЧАЛОПЕРИОДА(ВнутренниеПеречниСрезПоследних.Период, ДЕНЬ) = &ДеньДляПроверкиСрока";
			
	МассивЮрЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
	
	Если МассивЮрЛиц.Количество() > 0 Тогда
	    		
		ТекстСообщения = "Необходимо продлить квалифицированность у следующих клиентов:" + Символы.ПС + СтрСоединить(МассивЮрЛиц, Символы.ПС);
		
		СформироватьОповещение("Ежегодная проверка квалифицированных инвесторов", ТекстСообщения);	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОповещение(Тема, Текст)
	
	РеквизитыОповещения = Новый Структура();
	
	РеквизитыОповещения.Вставить("Организация",	ЭтотОбъект.Организация);				
	РеквизитыОповещения.Вставить("Тема",		Тема);
	РеквизитыОповещения.Вставить("Текст",		Текст);	
	                                                 	
	Справочники.Оповещения.СформироватьОповещения(ЭтотОбъект.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область Работа_с_регламентными_заданиями

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "УведомленияПоКвалифицированнымИнвесторам") Тогда
		
		ЭтотОбъект.Дата								= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		ЭтотОбъект.ДатаПроверкиКвалифицированности 	= НачалоДня(ТекущаяДата());
		ЭтотОбъект.Организация						= ПараметрыКоманды.Организация;
				
#Область СборСтатистики_Начало

		Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
			ЭтотОбъект, 
			"Период,Организация", 
			Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
		
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти

		ОтправитьУведомления();

#Область СборСтатистики_Конец

		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти

	КонецЕсли;   	
	
КонецПроцедуры // ВыполнитьКоманду

#КонецОбласти
